michal-gora/ArduinoCore-zephyr/boards.txt

##########################################################################################

# NOTE:
#
# The following board-specific properties are auto-generated by 'build.sh'
# and saved in 'boards.local.txt'. VALUES IN THIS FILE WILL HAVE NO EFFECT.
#
# - build.architecture
# - build.float-abi
# - build.fpu
# - build.mcu
# - upload.address
# - upload.maximum_data_size
# - upload.maximum_size

##########################################################################################

menu.debug=Debug
menu.link_mode=Link mode
menu.wait_linux_boot=Startup mode

##########################################################################################

# giga.menu.link_mode.dynamic=Dynamic
# giga.menu.link_mode.static=Static
# giga.menu.link_mode.static.build.link_mode=static
# giga.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# giga.build.zephyr_target=arduino_giga_r1//m7
# giga.build.zephyr_args=--shield arduino_giga_display_shield
# giga.build.zephyr_hals=hal_stm32 hal_infineon
# giga.build.variant=arduino_giga_r1_stm32h747xx_m7
# giga.build.artifact=zephyr_main
# 
# giga.build.extra_flags=
# giga.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# giga.build.board=GIGA
# giga.vid.0=0x2341
# giga.pid.0=0x0066
# giga.upload_port.0.vid=0x2341
# giga.upload_port.0.pid=0x0066
# 
# giga.upload.tool=dfu-util
# giga.upload.tool.default=dfu-util
# giga.upload.protocol=
# giga.upload.transport=
# giga.upload.vid=0x2341
# giga.upload.pid=0x0366
# giga.upload.interface=0
# giga.upload.use_1200bps_touch=true
# giga.upload.wait_for_upload_port=true
# giga.upload.native_usb=true
# 
# giga.bootloader.tool=dfu-util
# giga.bootloader.tool.default=dfu-util
# giga.bootloader.vid=0x2341
# giga.bootloader.pid=0x0366
# giga.bootloader.interface=0
# giga.bootloader.file=zephyr-{build.variant}.bin
# giga.bootloader.address=0x08040000
# 
# giga.debug.tool=gdb
# giga.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# giga.debug.server.openocd.scripts.1={programmer.transport_script}
# giga.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
# giga.debug.cortex-debug.custom.request=attach
# giga.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
# 
# ##########################################################################################
# 
# nano33ble.name=Arduino Nano 33 BLE
# nano33ble.build.core=arduino
# nano33ble.build.crossprefix=arm-zephyr-eabi-
# nano33ble.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# nano33ble.menu.debug.false=Standard
# nano33ble.menu.debug.true=Debug
# nano33ble.menu.debug.true.build.zsk_args.debug=-debug
# 
# nano33ble.menu.link_mode.dynamic=Dynamic
# nano33ble.menu.link_mode.static=Static
# nano33ble.menu.link_mode.static.build.link_mode=static
# nano33ble.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# nano33ble.build.zephyr_target=arduino_nano_33_ble//sense
# nano33ble.build.zephyr_args=
# nano33ble.build.zephyr_hals=hal_nordic
# nano33ble.build.artifact=zephyr_main
# nano33ble.build.variant=arduino_nano_33_ble_nrf52840_sense
# 
# nano33ble.build.extra_flags=
# nano33ble.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# nano33ble.build.board=NANO33BLE
# nano33ble.vid.0=0x2341
# nano33ble.pid.0=0x035a
# nano33ble.upload_port.0.vid=0x2341
# nano33ble.upload_port.0.pid=0x005a
# 
# nano33ble.upload.tool=bossac
# nano33ble.upload.tool.default=bossac
# nano33ble.upload.protocol=
# nano33ble.upload.transport=
# nano33ble.upload.vid=0x2341
# nano33ble.upload.pid=0x005a
# nano33ble.upload.interface=0
# nano33ble.upload.use_1200bps_touch=true
# nano33ble.upload.wait_for_upload_port=true
# nano33ble.upload.native_usb=true
# nano33ble.upload.offset=0x10000 # bootloader skips its own partition
# 
# nano33ble.bootloader.tool=bossac
# nano33ble.bootloader.tool.default=bossac
# nano33ble.bootloader.vid=0x2341
# nano33ble.bootloader.pid=0x035b
# nano33ble.bootloader.interface=0
# nano33ble.bootloader.file=zephyr-{build.variant}.bin
# nano33ble.bootloader.address=0x0000
# 
# nano33ble.debug.tool=gdb
# nano33ble.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# nano33ble.debug.server.openocd.scripts.1={programmer.transport_script}
# nano33ble.debug.server.openocd.scripts.2=target/nrf52.cfg
# nano33ble.debug.cortex-debug.custom.request=attach
# 
# ##############################################################################################################
# 
# ek_ra8d1.name=Renesas RA8D1 EK
# ek_ra8d1.build.core=arduino
# ek_ra8d1.build.crossprefix=arm-zephyr-eabi-
# ek_ra8d1.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# ek_ra8d1.menu.debug.false=Standard
# ek_ra8d1.menu.debug.true=Debug
# ek_ra8d1.menu.debug.true.build.zsk_args.debug=-debug
# 
# ek_ra8d1.menu.link_mode.dynamic=Dynamic
# ek_ra8d1.menu.link_mode.static=Static
# ek_ra8d1.menu.link_mode.static.build.link_mode=static
# ek_ra8d1.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# ek_ra8d1.build.zephyr_target=ek_ra8d1
# ek_ra8d1.build.zephyr_args=
# ek_ra8d1.build.zephyr_hals=hal_renesas
# ek_ra8d1.build.variant=ek_ra8d1_r7fa8d1bhecbd
# 
# ek_ra8d1.build.extra_flags=
# ek_ra8d1.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# ek_ra8d1.build.board=EK_RA8D1
# 
# #ek_ra8d1.recipe.hooks.objcopy.postobjcopy.4.pattern=cp {build.variant.path}/flasher.jlink "{build.path}/flasher.jlink"
# #ek_ra8d1.recipe.hooks.objcopy.postobjcopy.5.pattern=sed -i 's|SKETCH|"{build.path}/{build.project_name}.llext.dfu.bin"|g' "{build.path}/flasher.jlink"
# 
# ek_ra8d1.vid.0=0x2341
# ek_ra8d1.pid.0=0x0077
# ek_ra8d1.upload_port.0.vid=0x2341
# ek_ra8d1.upload_port.0.pid=0x0077
# 
# ek_ra8d1.upload.tool=pyocd
# ek_ra8d1.upload.tool.default=pyocd
# ek_ra8d1.upload.protocol=
# ek_ra8d1.upload.transport=
# ek_ra8d1.upload.vid=0x2341
# ek_ra8d1.upload.pid=0x0366
# ek_ra8d1.upload.interface=0
# ek_ra8d1.upload.use_1200bps_touch=false
# ek_ra8d1.upload.wait_for_upload_port=false
# ek_ra8d1.upload.native_usb=true
# ek_ra8d1.upload.target=R7FA8D1AH
# 
# ek_ra8d1.bootloader.tool=pyocd
# ek_ra8d1.bootloader.tool.default=pyocd
# ek_ra8d1.bootloader.file=zephyr-{build.variant}.elf
# ek_ra8d1.bootloader.target=R7FA8D1AH
# 
# 
# ##############################################################################################################
# 
# frdm_mcxn947.name=NXP FRDM MCXN947
# frdm_mcxn947.build.core=arduino
# frdm_mcxn947.build.crossprefix=arm-zephyr-eabi-
# frdm_mcxn947.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# frdm_mcxn947.menu.debug.false=Standard
# frdm_mcxn947.menu.debug.true=Debug
# frdm_mcxn947.menu.debug.true.build.zsk_args.debug=-debug
# 
# frdm_mcxn947.menu.link_mode.dynamic=Dynamic
# frdm_mcxn947.menu.link_mode.static=Static
# frdm_mcxn947.menu.link_mode.static.build.link_mode=static
# frdm_mcxn947.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# frdm_mcxn947.build.zephyr_target=frdm_mcxn947//cpu0
# frdm_mcxn947.build.zephyr_args=
# frdm_mcxn947.build.zephyr_hals=hal_nxp
# frdm_mcxn947.build.variant=frdm_mcxn947_mcxn947_cpu0
# 
# frdm_mcxn947.build.extra_flags=
# frdm_mcxn947.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# frdm_mcxn947.build.board=FRDM_MCXN947
# frdm_mcxn947.vid.0=0x1fc9
# frdm_mcxn947.pid.0=0x0143
# frdm_mcxn947.upload_port.0.vid=0x1fc9
# frdm_mcxn947.upload_port.0.pid=0x0143
# frdm_mcxn947.upload.target=mcxn947vdf
# 
# frdm_mcxn947.upload.tool=pyocd
# frdm_mcxn947.upload.tool.default=pyocd
# frdm_mcxn947.upload.protocol=
# frdm_mcxn947.upload.transport=
# frdm_mcxn947.upload.vid=0x1fc9
# frdm_mcxn947.upload.pid=0x0143
# frdm_mcxn947.upload.interface=0
# frdm_mcxn947.upload.use_1200bps_touch=false
# frdm_mcxn947.upload.wait_for_upload_port=false
# frdm_mcxn947.upload.native_usb=true
# 
# frdm_mcxn947.bootloader.tool=pyocd
# frdm_mcxn947.bootloader.tool.default=pyocd
# frdm_mcxn947.bootloader.file=zephyr-{build.variant}.elf
# frdm_mcxn947.bootloader.target=mcxn947vdf
# 
# 
# ##########################################################################################
# 
# portentah7.name=Arduino Portenta H7
# portentah7.build.core=arduino
# portentah7.build.crossprefix=arm-zephyr-eabi-
# portentah7.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# portentah7.menu.debug.false=Standard
# portentah7.menu.debug.true=Debug
# portentah7.menu.debug.true.build.zsk_args.debug=-debug
# 
# portentah7.menu.link_mode.dynamic=Dynamic
# portentah7.menu.link_mode.static=Static
# portentah7.menu.link_mode.static.build.link_mode=static
# portentah7.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# portentah7.build.zephyr_target=arduino_portenta_h7@1.0.0//m7
# portentah7.build.zephyr_args=
# portentah7.build.zephyr_hals=hal_stm32 hal_infineon
# portentah7.build.artifact=zephyr_main
# portentah7.build.variant=arduino_portenta_h7_stm32h747xx_m7
# 
# portentah7.build.extra_flags=
# portentah7.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# portentah7.build.board=PORTENTA_H7_M7
# portentah7.vid.0=0x2341
# portentah7.pid.0=0x005b
# portentah7.upload_port.0.vid=0x2341
# portentah7.upload_port.0.pid=0x035b
# 
# portentah7.upload.tool=dfu-util
# portentah7.upload.tool.default=dfu-util
# portentah7.upload.protocol=
# portentah7.upload.transport=
# portentah7.upload.vid=0x2341
# portentah7.upload.pid=0x035b
# portentah7.upload.interface=0
# portentah7.upload.use_1200bps_touch=true
# portentah7.upload.wait_for_upload_port=true
# portentah7.upload.native_usb=true
# 
# portentah7.bootloader.tool=dfu-util
# portentah7.bootloader.tool.default=dfu-util
# portentah7.bootloader.vid=0x2341
# portentah7.bootloader.pid=0x035b
# portentah7.bootloader.interface=0
# portentah7.bootloader.file=zephyr-{build.variant}.bin
# portentah7.bootloader.address=0x08040000
# 
# portentah7.debug.tool=gdb
# portentah7.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# portentah7.debug.server.openocd.scripts.1={programmer.transport_script}
# portentah7.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
# portentah7.debug.cortex-debug.custom.request=attach
# portentah7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
# 
# ##############################################################################################################
# 
# nicla_vision.name=Arduino Nicla Vision
# nicla_vision.build.core=arduino
# nicla_vision.build.crossprefix=arm-zephyr-eabi-
# nicla_vision.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# nicla_vision.menu.debug.false=Standard
# nicla_vision.menu.debug.true=Debug
# nicla_vision.menu.debug.true.build.zsk_args.debug=-debug
# 
# nicla_vision.menu.link_mode.dynamic=Dynamic
# nicla_vision.menu.link_mode.static=Static
# nicla_vision.menu.link_mode.static.build.link_mode=static
# nicla_vision.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# nicla_vision.build.zephyr_target=arduino_nicla_vision//m7
# nicla_vision.build.zephyr_args=
# nicla_vision.build.zephyr_hals=hal_stm32 hal_infineon
# nicla_vision.build.artifact=zephyr_main
# nicla_vision.build.variant=arduino_nicla_vision_stm32h747xx_m7
# 
# nicla_vision.build.extra_flags=
# nicla_vision.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# nicla_vision.build.board=NICLA_VISION
# nicla_vision.vid.0=0x2341
# nicla_vision.pid.0=0x005b
# nicla_vision.upload_port.0.vid=0x2341
# nicla_vision.upload_port.0.pid=0x025f
# 
# nicla_vision.upload.tool=dfu-util
# nicla_vision.upload.tool.default=dfu-util
# nicla_vision.upload.protocol=
# nicla_vision.upload.transport=
# nicla_vision.upload.vid=0x2341
# nicla_vision.upload.pid=0x035f
# nicla_vision.upload.interface=0
# nicla_vision.upload.use_1200bps_touch=true
# nicla_vision.upload.wait_for_upload_port=true
# nicla_vision.upload.native_usb=true
# 
# nicla_vision.bootloader.tool=dfu-util
# nicla_vision.bootloader.tool.default=dfu-util
# nicla_vision.bootloader.vid=0x2341
# nicla_vision.bootloader.pid=0x035f
# nicla_vision.bootloader.interface=0
# nicla_vision.bootloader.file=zephyr-{build.variant}.bin
# nicla_vision.bootloader.address=0x08040000
# 
# nicla_vision.debug.tool=gdb
# nicla_vision.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# nicla_vision.debug.server.openocd.scripts.1={programmer.transport_script}
# nicla_vision.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
# nicla_vision.debug.cortex-debug.custom.request=attach
# nicla_vision.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
# 
# ##############################################################################################################
# 
# frdm_rw612.name=NXP FRDM RW612
# frdm_rw612.build.core=arduino
# frdm_rw612.build.crossprefix=arm-zephyr-eabi-
# frdm_rw612.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# frdm_rw612.menu.debug.false=Standard
# frdm_rw612.menu.debug.true=Debug
# frdm_rw612.menu.debug.true.build.zsk_args.debug=-debug
# 
# frdm_rw612.menu.link_mode.dynamic=Dynamic
# frdm_rw612.menu.link_mode.static=Static
# frdm_rw612.menu.link_mode.static.build.link_mode=static
# frdm_rw612.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# frdm_rw612.build.zephyr_target=frdm_rw612
# frdm_rw612.build.zephyr_args=
# frdm_rw612.build.zephyr_hals=hal_stm32
# frdm_rw612.build.variant=frdm_rw612_rw612
# 
# frdm_rw612.build.extra_flags=
# frdm_rw612.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# frdm_rw612.build.board=FRDM_RW612
# frdm_rw612.vid.0=0x1fc9
# frdm_rw612.pid.0=0x0143
# frdm_rw612.upload_port.0.vid=0x1fc9
# frdm_rw612.upload_port.0.pid=0x0143
# frdm_rw612.upload.target=rw612
# 
# frdm_rw612.upload.tool=pyocd
# frdm_rw612.upload.tool.default=pyocd
# frdm_rw612.upload.protocol=
# frdm_rw612.upload.transport=
# frdm_rw612.upload.vid=0x1fc9
# frdm_rw612.upload.pid=0x0143
# frdm_rw612.upload.interface=0
# frdm_rw612.upload.use_1200bps_touch=false
# frdm_rw612.upload.wait_for_upload_port=false
# frdm_rw612.upload.native_usb=true
# 
# frdm_rw612.bootloader.tool=pyocd
# frdm_rw612.bootloader.tool.default=pyocd
# frdm_rw612.bootloader.file=zephyr-{build.variant}.elf
# frdm_rw612.bootloader.target=rw612
# 
# ##########################################################################################
# 
# nicla_sense.name=Arduino Nicla Sense ME
# nicla_sense.build.core=arduino
# nicla_sense.build.crossprefix=arm-zephyr-eabi-
# nicla_sense.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# nicla_sense.menu.link_mode.dynamic=Dynamic
# nicla_sense.menu.link_mode.static=Static
# nicla_sense.menu.link_mode.static.build.link_mode=static
# nicla_sense.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# nicla_sense.build.zephyr_target=arduino_nicla_sense_me
# nicla_sense.build.zephyr_args=
# nicla_sense.build.zephyr_hals=hal_nordic
# nicla_sense.build.artifact=zephyr_main
# nicla_sense.build.variant=arduino_nicla_sense_me_nrf52832
# 
# nicla_sense.openocd_cfg=flash_sketch.cfg
# nicla_sense.build.extra_flags=
# nicla_sense.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# nicla_sense.build.board=NICLA_SENSE_ME
# nicla_sense.vid.0=0x2341
# nicla_sense.pid.0=0x0360
# nicla_sense.upload_port.0.vid=0x2341
# nicla_sense.upload_port.0.pid=0x0060
# 
# nicla_sense.upload.tool=openocd
# nicla_sense.upload.tool.default=openocd
# nicla_sense.upload.protocol=
# nicla_sense.upload.config=-f target/nrf52.cfg
# nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
# nicla_sense.upload.vid=0x2341
# nicla_sense.upload.pid=0x0060
# nicla_sense.upload.interface=0
# nicla_sense.upload.use_1200bps_touch=false
# nicla_sense.upload.wait_for_upload_port=false
# nicla_sense.upload.native_usb=false
# nicla_sense.upload.target=nrf52
# 
# nicla_sense.bootloader.tool=openocd
# nicla_sense.bootloader.tool.default=openocd
# nicla_sense.bootloader.vid=0x2341
# nicla_sense.bootloader.pid=0x0360
# nicla_sense.bootloader.interface=0
# nicla_sense.bootloader.file=zephyr-{build.variant}.hex
# nicla_sense.bootloader.target=nrf52
# 
# nicla_sense.debug.tool=gdb
# nicla_sense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# nicla_sense.debug.server.openocd.scripts.1={programmer.transport_script}
# nicla_sense.debug.server.openocd.scripts.2=target/nrf52.cfg
# nicla_sense.debug.cortex-debug.custom.request=attach
# 
# 
# ##########################################################################################
# 
# portentac33.name=Arduino Portenta C33
# portentac33.build.core=arduino
# portentac33.build.crossprefix=arm-zephyr-eabi-
# portentac33.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# portentac33.menu.debug.false=Standard
# portentac33.menu.debug.true=Debug
# portentac33.menu.debug.true.build.zsk_args.debug=-debug
# 
# portentac33.menu.link_mode.dynamic=Dynamic
# portentac33.menu.link_mode.static=Static
# portentac33.menu.link_mode.static.build.link_mode=static
# portentac33.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# portentac33.build.zephyr_target=arduino_portenta_c33
# portentac33.build.zephyr_args=
# portentac33.build.zephyr_hals=hal_renesas nanopb
# portentac33.build.artifact=zephyr_main
# portentac33.build.variant=arduino_portenta_c33_r7fa6m5bh3cfc
# 
# portentac33.build.extra_flags=
# portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# portentac33.build.board=PORTENTA_C33
# portentac33.vid.0=0x2341
# portentac33.pid.0=0x0068
# portentac33.upload_port.0.vid=0x2341
# portentac33.upload_port.0.pid=0x0068
# portentac33.upload.target=portentac33
# 
# portentac33.upload.tool=dfu-util
# portentac33.upload.tool.default=dfu-util
# portentac33.upload.protocol=
# portentac33.upload.transport=
# portentac33.upload.vid=0x2341
# portentac33.upload.pid=0x0368
# portentac33.upload.interface=1
# portentac33.upload.use_1200bps_touch=true
# portentac33.upload.wait_for_upload_port=false
# portentac33.upload.native_usb=true
