michal-gora/ArduinoCore-zephyr/boards.txt
# portentac33.upload.dfuse=-Q -w
# 
# portentac33.bootloader.tool=dfu-util
# portentac33.bootloader.tool.default=dfu-util
# portentac33.bootloader.file=zephyr-{build.variant}.bin
# portentac33.bootloader.interface=0
# portentac33.bootloader.address=0x10000
# portentac33.bootloader.dfuse=-Q
# 
# ##########################################################################################
# 
# opta.name=Arduino Opta
# opta.build.core=arduino
# opta.build.crossprefix=arm-zephyr-eabi-
# opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# opta.menu.debug.false=Standard
# opta.menu.debug.true=Debug
# opta.menu.debug.true.build.zsk_args.debug=-debug
# 
# opta.menu.link_mode.dynamic=Dynamic
# opta.menu.link_mode.static=Static
# opta.menu.link_mode.static.build.link_mode=static
# opta.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# opta.build.zephyr_target=arduino_opta//m7
# opta.build.zephyr_args=
# opta.build.zephyr_hals=hal_stm32 hal_infineon
# opta.build.artifact=zephyr_main
# opta.build.variant=arduino_opta_stm32h747xx_m7
# 
# opta.build.extra_flags=
# opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# opta.build.board=OPTA
# opta.vid.0=0x2341
# opta.pid.0=0x0064
# opta.upload_port.0.vid=0x2341
# opta.upload_port.0.pid=0x0364
# 
# opta.upload.tool=dfu-util
# opta.upload.tool.default=dfu-util
# opta.upload.protocol=
# opta.upload.transport=
# opta.upload.vid=0x2341
# opta.upload.pid=0x0364
# opta.upload.interface=0
# opta.upload.use_1200bps_touch=true
# opta.upload.wait_for_upload_port=true
# opta.upload.native_usb=true
# 
# opta.bootloader.tool=dfu-util
# opta.bootloader.tool.default=dfu-util
# opta.bootloader.vid=0x2341
# opta.bootloader.pid=0x0364
# opta.bootloader.interface=0
# opta.bootloader.file=zephyr-{build.variant}.bin
# opta.bootloader.address=0x08040000
# 
# opta.debug.tool=gdb
# opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# opta.debug.server.openocd.scripts.1={programmer.transport_script}
# opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
# opta.debug.cortex-debug.custom.request=attach
# opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
# 
# ##########################################################################################
# 
# nano_matter.name=Arduino Nano Matter
# nano_matter.build.core=arduino
# nano_matter.build.crossprefix=arm-zephyr-eabi-
# nano_matter.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# nano_matter.menu.link_mode.dynamic=Dynamic
# nano_matter.menu.link_mode.static=Static
# nano_matter.menu.link_mode.static.build.link_mode=static
# nano_matter.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# nano_matter.build.zephyr_target=arduino_nano_matter
# nano_matter.build.zephyr_args=
# nano_matter.build.zephyr_hals=hal_silabs
# nano_matter.build.artifact=zephyr_main
# nano_matter.build.variant=arduino_nano_matter_mgm240sd22vna
# 
# nano_matter.openocd_cfg=flash_sketch.cfg
# nano_matter.build.extra_flags=
# nano_matter.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# nano_matter.build.board=ARDUINO_NANO_MATTER
# nano_matter.vid.0=0x2341
# nano_matter.pid.0=0x0072
# nano_matter.upload_port.0.vid=0x2341
# nano_matter.upload_port.0.pid=0x0072
# 
# nano_matter.upload.tool=openocd
# nano_matter.upload.tool.default=openocd
# nano_matter.upload.config=-f target/efm32s2_g23.cfg
# nano_matter.upload.programmer=-f interface/cmsis-dap.cfg
# nano_matter.upload.protocol=SWD
# nano_matter.upload.setup_command=
# nano_matter.upload.use_1200bps_touch=false
# nano_matter.upload.wait_for_upload_port=false
# nano_matter.upload.native_usb=false
# 
# nano_matter.bootloader.tool=openocd
# nano_matter.bootloader.tool.default=openocd
# nano_matter.bootloader.vid=0x2341
# nano_matter.bootloader.pid=0x0072
# nano_matter.bootloader.interface=0
# nano_matter.bootloader.file=zephyr-{build.variant}.hex
# nano_matter.bootloader.target=arduino_nano_matter
# 
# nano_matter.debug.server=openocd
# nano_matter.debug.server.openocd.scripts.0=interface/cmsis-dap.cfg
# nano_matter.debug.server.openocd.scripts.1=target/efm32s2_g23.cfg
# nano_matter.debug.cortex-debug.custom.postAttachCommands.0=monitor reset halt
# #nano_matter.debug.cortex-debug.custom.postAttachCommands.1=monitor reset_config srst_nogate
# #nano_matter.debug.cortex-debug.custom.postAttachCommands.2=monitor gdb_breakpoint_override hard
# nano_matter.debug.cortex-debug.custom.postAttachCommands.3=monitor gdb_sync
# nano_matter.debug.cortex-debug.custom.postAttachCommands.4=c
# nano_matter.debug.cortex-debug.custom.overrideRestartCommands.0=monitor reset halt
# nano_matter.debug.cortex-debug.custom.overrideRestartCommands.1=monitor gdb_sync
# nano_matter.debug.cortex-debug.custom.overrideRestartCommands.2=c
# nano_matter.debug.cortex-debug.custom.request=attach
# 
# ##############################################################################################################
# 
# unoq.name=Arduino UNO Q
# unoq.build.core=arduino
# unoq.build.crossprefix=arm-zephyr-eabi-
# unoq.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# unoq.menu.link_mode.dynamic=Dynamic
# unoq.menu.link_mode.static=Static
# unoq.menu.link_mode.static.build.link_mode=static
# unoq.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# unoq.menu.wait_linux_boot.yes=Wait for Linux
# unoq.menu.wait_linux_boot.no=Immediate
# unoq.menu.wait_linux_boot.no.build.boot_mode=immediate
# unoq.menu.wait_linux_boot.app=Wait for App
# unoq.menu.wait_linux_boot.app.build.boot_mode=app
# 
# unoq.build.zephyr_target=arduino_uno_q
# unoq.build.zephyr_args=
# unoq.build.variant=arduino_uno_q_stm32u585xx
# unoq.build.artifact=zephyr_unoq
# unoq.build.subarch=zephyr
# 
# unoq.openocd_cfg=flash_sketch.cfg
# unoq.build.extra_flags=
# unoq.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# unoq.build.board=UNO_Q
# unoq.build.zephyr_hals=hal_stm32
# unoq.build.zephyr_toolchain=arm-zephyr-eabi
# unoq.vid.0=0x2341
# unoq.pid.0=0x0078
# unoq.upload_port.0.vid=0x2341
# unoq.upload_port.0.pid=0x0078
# unoq.upload.target=stm32u585zitxq
# 
# unoq.upload.tool=remoteocd
# unoq.upload.tool.default=remoteocd
# unoq.upload.tool.network=remoteocd_network
# unoq.upload.protocol=
# unoq.upload.transport=
# unoq.upload.vid=0x2341
# unoq.upload.pid=0x0078
# unoq.upload.interface=0
# unoq.upload.use_1200bps_touch=false
# unoq.upload.wait_for_upload_port=false
# unoq.upload.native_usb=true
# 
# unoq.bootloader.tool=remoteocd
# unoq.bootloader.tool.default=remoteocd
# unoq.bootloader.file=zephyr-{build.variant}.elf
# unoq.bootloader.target=stm32u585zitxq
# 
# ##############################################################################################################
# 
# nano_connect.name=Arduino Nano RP2040 Connect
# nano_connect.build.core=arduino
# nano_connect.build.crossprefix=arm-zephyr-eabi-
# nano_connect.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/
# 
# nano_connect.menu.debug.false=Standard
# nano_connect.menu.debug.true=Debug
# nano_connect.menu.debug.true.build.zsk_args.debug=-debug
# 
# nano_connect.menu.link_mode.dynamic=Dynamic
# nano_connect.menu.link_mode.static=Static
# nano_connect.menu.link_mode.static.build.link_mode=static
# nano_connect.menu.link_mode.static.upload.extension=bin-zsk.bin
# 
# nano_connect.build.zephyr_target=arduino_nano_connect
# nano_connect.build.zephyr_args=
# nano_connect.build.zephyr_hals=hal_rpi_pico
# nano_connect.build.artifact=zephyr_main
# nano_connect.build.variant=arduino_nano_connect_rp2040
# nano_connect.build.mcu=cortex-m0plus
# nano_connect.build.fpu=
# nano_connect.build.architecture=cortex-m0plus
# nano_connect.compiler.zephyr.arch.define=
# 
# nano_connect.build.float-abi=-mfloat-abi=soft
# nano_connect.build.extra_flags=
# nano_connect.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
# nano_connect.recipe.hooks.objcopy.postobjcopy.3.pattern="{runtime.tools.bin2uf2.path}/bin2uf2" {upload.address} {upload.familyid} "{build.path}/{build.project_name}.{upload.extension}" "{build.path}/{build.project_name}.uf2"
# nano_connect.build.board=NANO_RP2040_CONNECT
# nano_connect.compiler.zephyr=
# nano_connect.vid.0=0x2341
# nano_connect.pid.0=0x005E
# nano_connect.upload_port.0.vid=0x2341
# nano_connect.upload_port.0.pid=0x005E
# 
# nano_connect.upload.tool=picotool
# nano_connect.upload.tool.default=picotool
# nano_connect.upload.protocol=
# nano_connect.upload.transport=
# nano_connect.upload.vid=0x2341
# nano_connect.upload.pid=0x005E
# nano_connect.upload.interface=0
# nano_connect.upload.use_1200bps_touch=true
# nano_connect.upload.wait_for_upload_port=false
# nano_connect.upload.native_usb=true
# nano_connect.upload.maximum_size=16777216
# nano_connect.upload.maximum_data_size=270336
# 
# nano_connect.upload.address=0x100E0000
# nano_connect.upload.familyid=0xe48bff56
# 
# nano_connect.bootloader.tool=picotool
# nano_connect.bootloader.tool.default=picotool
# nano_connect.bootloader.vid=0x2341
# nano_connect.bootloader.pid=0x005E
# nano_connect.bootloader.interface=0
# nano_connect.bootloader.file=zephyr-{build.variant}
# 
# nano_connect.debug.tool=gdb
# nano_connect.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
# nano_connect.debug.server.openocd.scripts.1={programmer.transport_script}
# nano_connect.debug.server.openocd.scripts.2=target/rp2040-core0.cfg
# nano_connect.debug.cortex-debug.custom.request=attach
# nano_connect.debug.svd_file={runtime.platform.path}/svd/rp2040.svd
# 
# ##############################################################################################################

kit_pse84_ai.name=Infineon KIT-PSE84-AI (PSOC Edge E84)
kit_pse84_ai.build.core=arduino
kit_pse84_ai.build.crossprefix=arm-zephyr-eabi-
kit_pse84_ai.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/
kit_pse84_ai.menu.debug.false=Standard
kit_pse84_ai.menu.debug.true=Debug
kit_pse84_ai.menu.debug.true.build.zsk_args.debug=-debug
kit_pse84_ai.menu.link_mode.dynamic=Dynamic
kit_pse84_ai.menu.link_mode.static=Static
kit_pse84_ai.menu.link_mode.static.build.link_mode=static
kit_pse84_ai.menu.link_mode.static.upload.extension=bin-zsk.bin
kit_pse84_ai.build.zephyr_target=kit_pse84_ai/pse846gps2dbzc4a/m33
kit_pse84_ai.build.zephyr_args=
kit_pse84_ai.build.zephyr_hals=hal_infineon
kit_pse84_ai.build.variant=kit_pse84_ai_pse846gps2dbzc4a_m33
kit_pse84_ai.build.mcu=cortex-m33
kit_pse84_ai.build.fpu=-mfpu=fpv5-sp-d16
kit_pse84_ai.build.architecture=cortex-m33
kit_pse84_ai.build.float-abi=-mfloat-abi=hard
kit_pse84_ai.compiler.zephyr.specs=
kit_pse84_ai.build.extra_flags=
kit_pse84_ai.build.specs=
kit_pse84_ai.build.link_command="{compiler.path}{compiler.c.elf.cmd}" "-L{build.path}" "-L{build.variant.path}" {compiler.c.elf.flags} {compiler.c.elf.extra_flags} {build.extra_flags} {build.extra_ldflags} {compiler.zephyr.common_ldflags} {compiler.ldflags} {object_files} -Wl,--start-group "{build.path}/{archive_file}" {compiler.zephyr.extra_ldflags} {compiler.libraries.ldflags} -Wl,--end-group {build.link_args.{build.link_mode}}
kit_pse84_ai.build.postbuild.cmd="{tools.openocd.path}/{tools.openocd.cmd}" exit
kit_pse84_ai.build.board=KIT_PSE84_AI
kit_pse84_ai.upload.address=0x60200000
kit_pse84_ai.upload.target=pse84
kit_pse84_ai.upload.tool=openocd
kit_pse84_ai.upload.tool.default=openocd
kit_pse84_ai.tools.openocd.path={runtime.tools.openocd.path}
kit_pse84_ai.tools.openocd.cmd=bin/openocd
kit_pse84_ai.tools.openocd.cmd.windows=bin/openocd.exe
kit_pse84_ai.programmer.default=cmsis-dap
kit_pse84_ai.tools.openocd.upload.pattern="{path}/{cmd}" {upload.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase {{build.path}/{build.project_name}.{upload.extension}} {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.program.pattern="{path}/{cmd}" {program.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase {{build.path}/{build.project_name}.{upload.extension}} {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.bootloader.pattern="{path}/{cmd}" {bootloader.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "telnet_port disabled; init; reset init; halt; adapter speed 10000; program {{runtime.platform.path}/firmwares/zephyr-{build.variant}.hex}; reset run; shutdown"
kit_pse84_ai.tools.openocd.upload.pattern.windows=cmd /C cd /D "{build.path}" && "{path}/{cmd}" {upload.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set sketch_file [list {build.project_name}.{upload.extension}]; telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase $sketch_file {upload.address} bin; reset run; shutdown"
kit_pse84_ai.tools.openocd.program.pattern.windows=cmd /C cd /D "{build.path}" && "{path}/{cmd}" {program.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set sketch_file [list {build.project_name}.{upload.extension}]; telnet_port disabled; init; reset init; halt; adapter speed 10000; flash write_image erase $sketch_file {upload.address} bin; reset run; shutdown"
kit_pse84_ai.upload.protocol=
kit_pse84_ai.upload.transport=
kit_pse84_ai.upload.interface=0
kit_pse84_ai.upload.use_1200bps_touch=false
kit_pse84_ai.upload.wait_for_upload_port=false
kit_pse84_ai.upload.native_usb=false
kit_pse84_ai.upload.maximum_size=1047552
kit_pse84_ai.upload.maximum_data_size=135168
kit_pse84_ai.bootloader.tool=openocd
kit_pse84_ai.bootloader.tool.default=openocd
kit_pse84_ai.tools.openocd.bootloader.pattern.windows=cmd /C cd /D "{runtime.platform.path}/firmwares" && "{path}/{cmd}" {bootloader.verbose} -s "{path}/scripts/" -s "{path}/share/openocd/scripts/" -s "{runtime.platform.path}/variants/{build.variant}/" -f "{runtime.platform.path}/variants/{build.variant}/openocd.cfg" -c "set bootloader_file [list zephyr-{build.variant}.hex]; telnet_port disabled; init; reset init; halt; adapter speed 10000; program $bootloader_file; reset run; shutdown"
kit_pse84_ai.bootloader.target=pse84

##############################################################################################################
